In [1]:
import seaborn as sb

In [2]:
tips = sb.load_dataset("tips")

In [4]:
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [4]:
tips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
total_bill    244 non-null float64
tip           244 non-null float64
sex           244 non-null category
smoker        244 non-null category
day           244 non-null category
time          244 non-null category
size          244 non-null int64
dtypes: category(4), float64(2), int64(1)
memory usage: 7.2 KB

In [5]:
tips['day'].unique()

[Sun, Sat, Thur, Fri]
Categories (4, object): [Sun, Sat, Thur, Fri]

In [6]:
tips['day'].value_counts()

Sat     87
Sun     76
Thur    62
Fri     19
Name: day, dtype: int64

In [7]:
days = tips.groupby(['day'])

In [8]:
type(days)

pandas.core.groupby.groupby.DataFrameGroupBy

In [9]:
days.sum()

      total_bill     tip  size
day
Thur     1096.33  171.83   152
Fri       325.88   51.96    40
Sat      1778.40  260.40   219
Sun      1627.16  247.39   216

In [10]:
days['tip'].sum()

day
Thur    171.83
Fri      51.96
Sat     260.40
Sun     247.39
Name: tip, dtype: float64

In [11]:
days['tip'].mean()

day
Thur    2.771452
Fri     2.734737
Sat     2.993103
Sun     3.255132
Name: tip, dtype: float64

In [13]:
tips.groupby(['day','time'])['tip','total_bill'].mean()

                  tip  total_bill
day  time
Thur Lunch   2.767705   17.664754
     Dinner  3.000000   18.780000
Fri  Lunch   2.382857   12.845714
     Dinner  2.940000   19.663333
Sat  Lunch        NaN         NaN
     Dinner  2.993103   20.441379
Sun  Lunch        NaN         NaN
     Dinner  3.255132   21.410000

In [16]:
for d,rows in tips.groupby('day'):
     print(d, rows['total_bill'].sum())

Thur 1096.33
Fri 325.88
Sat 1778.3999999999999
Sun 1627.16

In [24]:
ag = tips.groupby(['day']).aggregate(['mean','sum','max'])

In [25]:
type(ag)

pandas.core.frame.DataFrame

In [30]:
print(tips['size'].nunique())
print(tips['size'].unique())

6
[2 3 4 1 6 5]

In [33]:
tips.groupby(['day','time'], as_index=False).sum()

    day    time  total_bill     tip   size
0  Thur   Lunch     1077.55  168.83  150.0
1  Thur  Dinner       18.78    3.00    2.0
2   Fri   Lunch       89.92   16.68   14.0
3   Fri  Dinner      235.96   35.28   26.0
4   Sat   Lunch         NaN     NaN    NaN
5   Sat  Dinner     1778.40  260.40  219.0
6   Sun   Lunch         NaN     NaN    NaN
7   Sun  Dinner     1627.16  247.39  216.0

In [34]:
tips.groupby(['day','time']).sum()

             total_bill     tip   size
day  time
Thur Lunch      1077.55  168.83  150.0
     Dinner       18.78    3.00    2.0
Fri  Lunch        89.92   16.68   14.0
     Dinner      235.96   35.28   26.0
Sat  Lunch          NaN     NaN    NaN
     Dinner     1778.40  260.40  219.0
Sun  Lunch          NaN     NaN    NaN
     Dinner     1627.16  247.39  216.0

In [36]:
import numpy as np

In [39]:
tips.pivot_table(index='day',columns='time', values='total_bill', aggfunc=np.sum)

time    Lunch   Dinner
day
Thur  1077.55    18.78
Fri     89.92   235.96
Sat       NaN  1778.40
Sun       NaN  1627.16

In [42]:
tips.pivot_table(index=['day','size'],columns='smoker', values=['total_bill','tip'], aggfunc=np.sum)

             tip        total_bill
smoker       Yes     No        Yes      No
day  size
Thur 1       NaN   1.83        NaN   10.07
     2     35.28  81.96     227.42  500.11
     3      7.23   3.54      35.18   41.46
     4      9.00  12.09      63.64   86.11
     5       NaN   5.00        NaN   41.19
     6       NaN  15.90        NaN   91.15
Fri  1      1.92    NaN       8.58     NaN
     2     34.06   8.25     203.45   57.70
     3       NaN   3.00        NaN   15.98
     4      4.73    NaN      40.17     NaN
Sat  1      1.00   1.00       3.07    7.25
     2     69.35  64.08     491.71  400.66
     3     27.41  40.95     195.62  263.55
     4     20.01  33.60     175.07  213.32
     5      3.00    NaN      28.15     NaN
Sun  2     40.14  69.72     262.50  422.34
     3     14.50  32.31     107.50  225.26
     4     10.18  63.40      57.82  422.57
     5      2.00  10.14      30.46   50.54
     6       NaN   5.00        NaN   48.17